rails/fakebook_app/app/controllers/friend_requests_controller.rb

  def create
    friend = User.find(params[:id])
    @friend_request = current_user.friend_requests.new(friend: friend)

    if @friend_request.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 18], ["LIMIT", 1]]
INSERT INTO "friend_requests" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 18], ["friend_id", 7], ["created_at", "2017-11-17 17:14:28.768044"], ["updated_at", "2017-11-17 17:14:28.768044"]]

  def destroy
    friend = User.find(params[:id])
    @friend_request = current_user.friend_requests.find_by(:friend_id, friend.id)
    @friend_request.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT  "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."user_id" = $1 AND "friend_requests"."friend_id" = $2 LIMIT $3  [["user_id", 18], ["friend_id", 7], ["LIMIT", 1]]
DELETE FROM "friend_requests" WHERE "friend_requests"."id" = $1  [["id", 1]]