rails/fakebook_app/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (first_name ILIKE '%chuck norris%' or last_name ILIKE '%chuck norris%' or full_name ILIKE '%chuck norris%')
---
  def index
    user_search = params[:search].split(" ")
    if user_search.count > 1
      @users = User.search_by_full_name(user_search)
    else
      @users = User.search(user_search[0])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 173], ["LIMIT", 1]]
---
    def set_user
      if params[:id]
        @user = User.find(params[:id])