rails/fakebook_app/app/views/users/index.html.erb

                    <small>
                      <%= pluralize(search_result.friended_users.count, 'friend') %>
---
SELECT "users".* FROM "users" WHERE (first_name ILIKE '%chuck norris%' or last_name ILIKE '%chuck norris%' or full_name ILIKE '%chuck norris%')
SELECT COUNT(*) FROM "users" WHERE (first_name ILIKE '%bl%' or last_name ILIKE '%bl%')